/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//  B3/YENA : 2D/3D 렌더링 엔진.						                       // 
//                                                                         //
//  제 작 : Kihong Kim / mad_dog@hanmail.net                               // 
//          Zero-G Tech,Inc http://www.zero-g.kr						   //	
//  초기개발 : 2003.12 - 2004.03.                                          //
//  개발환경 : OS - Windows 2k SP4 / Visual Studio 6.0/2003/2005/2008       //
//                  DirectX 9.0b(2003, summer)                             //
//                  DirectX 9.0c(2007, November)                           //
//                  OpenGL 1.x / 2.x                                       //
//             H/W - AMD Athlon XP(Barton) 2500+@2300                      //    
//                   ATI Radeon 9600 Pro                                   //
//                   ABit NF7-II /w SAMSUNG DDR 512MB                      //
//                   SB Live! DE 5.1                                       //
//  테스트 환경 : CPU - AMD Athlon										   //	 
//                      AMD Athlonx64 w/q4                                 // 
//                      Intel Pentium III/IV & Celeron                     //
//                      Core2 w/Quad                                       //
//                VGA - ATI Radeon 9xxx Series                             //
//                          Radeon 1xxx Series                             //
//                          Radeon HD 3/4/5/6 Series                       //
//                      nVidia GeForce 2 MX/Ti Series.                     //  
//                             GeForce 3 Ti Series.                        //
//                             GeForce 4 MX/Ti Series.                     //
//                             GeForce FX Series.                          //
//                             GeForce 5/6/7/8/9xxx Series.                //
//                             GeForce 2/4xx GTS Series.                   //
//                             GeForce 7xx GTX Series.                     //
//                             GeForce 2Way-SLI / 3Way-SLI		   	       //
//                OS - Windows 98 / 2K / XP / VISTA / Win7 x32:x64         //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////
//
// __temp__.cpp : __작업__ 소스
//
// DirectX 기준 버전 : DX11
//
// 2003.11.4. Kihong Kim / mad_dog@hanmail.net
// 2010.12.01. Update. (DX11.Jun.2010)
// 2016.12.27. Update. (DX11. Windows SDK 8.1)
//
#pragma warning(disable:4996)

#include "Yena.h"						//Yena 엔진 필수 헤더.
//#include "Windows.h" 
//#include "stdio.h"
//#include "d3dcompiler.h"				//DX 셰이더 컴파일러 헤더.
//#pragma comment(lib, "d3dcompiler")	//DX 셰이더 컴파일러 라이브러리.  D3DCompiler.dll 필요.
#include "__temp__.h"						//__작업__ 헤더.


/////////////////////////////////////////////////////////////////////////////
//
//  __작업__ 전역 데이터들.
//  

namespace YENA
{
	//....
}

 




//////////////////////////////////////////////////////////////////////////////// 
//////////////////////////////////////////////////////////////////////////////// 
//////////////////////////////////////////////////////////////////////////////// 
//////////////////////////////////////////////////////////////////////////////// 
//////////////////////////////////////////////////////////////////////////////// 
//////////////////////////////////////////////////////////////////////////////// 
//
// __작업__  함수들
//
//////////////////////////////////////////////////////////////////////////////// 

/////////////////////////////////////////////////////////////////////////////
//
//  __작업__ 초기화 객체 생성
//
int __temp__Create(LPDEVICE pDev)
{
	//...

	return YN_OK;
}


/////////////////////////////////////////////////////////////////////////////
//
// __작업__ 개체 제거 
//
void __temp__Release()
{
	 //...
}



////////////////////////////////////////////////////////////////////////////// 
//
//  __작업__  개체 갱신.
//
void __temp__Update(float dTime)
{
	//...
}

 

////////////////////////////////////////////////////////////////////////////// 
//
//  __작업__  개체 그리기.
//
void __temp__Draw(float dTime)
{
	//...
}



 


/****************** end of file "__temp__.cpp" *********************************/



